app/views/workouts/index.html.erb

            <hr>
            <% workout.exercises.each do |exercise| %>
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."workout_id" = ?  [["workout_id", 4]]