app/controllers/exercises_controller.rb

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @exercise = Exercise.new
    @path = [Workout.find(params[:workout_id]), @exercise]

INSERT INTO "exercises" ("name", "weight", "sets", "reps", "created_at", "updated_at", "workout_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "bench press"], ["weight", 2], ["sets", 2], ["reps", 2], ["created_at", "2022-07-26 14:24:28.830167"], ["updated_at", "2022-07-26 14:24:28.830167"], ["workout_id", 1]]
---
  def create
    @exercise = Exercise.new(exercise_params)

    respond_to do |format|
      if @exercise.save

DELETE FROM "exercises" WHERE "exercises"."id" = ?  [["id", 9]]
---
  def destroy
    @exercise.destroy

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_workout
      @workout = Workout.find(params[:workout_id])