app/controllers/workouts_controller.rb

  def index
    @workouts = Workout.all.order('created_at DESC')
---
SELECT "workouts".* FROM "workouts" ORDER BY created_at DESC

  def create
    @workout = Workout.new(workout_params)

    respond_to do |format|
      if @workout.save
---
INSERT INTO "workouts" ("date", "split_day", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["date", "2022-07-25 14:53:00"], ["split_day", ""], ["created_at", "2022-07-25 14:53:41.237234"], ["updated_at", "2022-07-25 14:53:41.237234"]]

  def destroy
    @workout.destroy
---
DELETE FROM "workouts" WHERE "workouts"."id" = ?  [["id", 6]]

    def set_workout
      @workout = Workout.find(params[:id])
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]